results/oltp_read_only_8thr_2m/20240308-075623_2c132e45cb624a39ac7f23ea78f082078277a450_3.out
sysbench 1.1.0-2ca9e3f (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 1 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1s ] thds: 8 tps: 211.56 qps: 3451.79 (r/w/o: 3020.69/0.00/431.10) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 2s ] thds: 8 tps: 233.08 qps: 3742.22 (r/w/o: 3276.07/0.00/466.15) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 3s ] thds: 8 tps: 239.00 qps: 3830.05 (r/w/o: 3352.04/0.00/478.01) lat (ms,99%): 55.82 err/s: 0.00 reconn/s: 0.00
[ 4s ] thds: 8 tps: 244.00 qps: 3880.00 (r/w/o: 3392.00/0.00/488.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 5s ] thds: 8 tps: 252.98 qps: 4067.75 (r/w/o: 3561.78/0.00/505.97) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 6s ] thds: 8 tps: 249.00 qps: 3988.03 (r/w/o: 3490.02/0.00/498.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 7s ] thds: 8 tps: 249.01 qps: 3976.22 (r/w/o: 3478.19/0.00/498.03) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 8s ] thds: 8 tps: 247.96 qps: 3972.37 (r/w/o: 3476.45/0.00/495.92) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 9s ] thds: 8 tps: 253.01 qps: 4040.08 (r/w/o: 3534.07/0.00/506.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 248.02 qps: 3989.36 (r/w/o: 3493.32/0.00/496.05) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 11s ] thds: 8 tps: 247.97 qps: 3954.53 (r/w/o: 3458.59/0.00/495.94) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 12s ] thds: 8 tps: 256.00 qps: 4085.98 (r/w/o: 3573.98/0.00/512.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 13s ] thds: 8 tps: 253.04 qps: 4063.58 (r/w/o: 3557.50/0.00/506.07) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 14s ] thds: 8 tps: 258.95 qps: 4142.17 (r/w/o: 3624.27/0.00/517.90) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 256.99 qps: 4102.79 (r/w/o: 3588.81/0.00/513.97) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 16s ] thds: 8 tps: 258.00 qps: 4120.07 (r/w/o: 3604.06/0.00/516.01) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 17s ] thds: 8 tps: 256.01 qps: 4110.12 (r/w/o: 3598.11/0.00/512.02) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 18s ] thds: 8 tps: 261.93 qps: 4181.89 (r/w/o: 3658.03/0.00/523.86) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 19s ] thds: 8 tps: 259.13 qps: 4142.08 (r/w/o: 3623.82/0.00/518.26) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 250.00 qps: 4001.99 (r/w/o: 3501.99/0.00/500.00) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 21s ] thds: 8 tps: 254.99 qps: 4061.81 (r/w/o: 3551.84/0.00/509.98) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 22s ] thds: 8 tps: 244.01 qps: 3915.13 (r/w/o: 3427.11/0.00/488.02) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 23s ] thds: 8 tps: 251.00 qps: 4037.05 (r/w/o: 3535.04/0.00/502.01) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 24s ] thds: 8 tps: 259.99 qps: 4157.92 (r/w/o: 3637.93/0.00/519.99) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 268.98 qps: 4290.75 (r/w/o: 3752.78/0.00/537.97) lat (ms,99%): 44.17 err/s: 0.00 reconn/s: 0.00
[ 26s ] thds: 8 tps: 248.00 qps: 3981.93 (r/w/o: 3485.94/0.00/495.99) lat (ms,99%): 51.94 err/s: 0.00 reconn/s: 0.00
[ 27s ] thds: 8 tps: 255.01 qps: 4073.19 (r/w/o: 3563.17/0.00/510.02) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 28s ] thds: 8 tps: 256.00 qps: 4101.98 (r/w/o: 3589.99/0.00/512.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 29s ] thds: 8 tps: 267.01 qps: 4271.22 (r/w/o: 3737.20/0.00/534.03) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 265.99 qps: 4235.78 (r/w/o: 3703.81/0.00/531.97) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 31s ] thds: 8 tps: 251.01 qps: 4033.17 (r/w/o: 3531.15/0.00/502.02) lat (ms,99%): 54.83 err/s: 0.00 reconn/s: 0.00
[ 32s ] thds: 8 tps: 257.99 qps: 4110.81 (r/w/o: 3594.83/0.00/515.98) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 33s ] thds: 8 tps: 261.95 qps: 4205.16 (r/w/o: 3681.27/0.00/523.90) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 34s ] thds: 8 tps: 260.06 qps: 4161.04 (r/w/o: 3640.91/0.00/520.13) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 256.92 qps: 4122.77 (r/w/o: 3608.93/0.00/513.85) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 36s ] thds: 8 tps: 258.99 qps: 4132.90 (r/w/o: 3614.91/0.00/517.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 37s ] thds: 8 tps: 258.00 qps: 4129.95 (r/w/o: 3613.95/0.00/515.99) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 38s ] thds: 8 tps: 253.99 qps: 4065.84 (r/w/o: 3557.86/0.00/507.98) lat (ms,99%): 56.84 err/s: 0.00 reconn/s: 0.00
[ 39s ] thds: 8 tps: 258.10 qps: 4142.58 (r/w/o: 3626.38/0.00/516.20) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 261.00 qps: 4172.02 (r/w/o: 3650.01/0.00/522.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 41s ] thds: 8 tps: 264.00 qps: 4210.96 (r/w/o: 3682.97/0.00/528.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 42s ] thds: 8 tps: 249.99 qps: 3980.83 (r/w/o: 3480.85/0.00/499.98) lat (ms,99%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 43s ] thds: 8 tps: 276.00 qps: 4435.00 (r/w/o: 3883.00/0.00/552.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 44s ] thds: 8 tps: 266.01 qps: 4263.19 (r/w/o: 3731.16/0.00/532.02) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 274.00 qps: 4387.03 (r/w/o: 3839.02/0.00/548.00) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 46s ] thds: 8 tps: 258.99 qps: 4135.78 (r/w/o: 3617.81/0.00/517.97) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 47s ] thds: 8 tps: 270.01 qps: 4325.19 (r/w/o: 3785.17/0.00/540.02) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 48s ] thds: 8 tps: 277.00 qps: 4423.04 (r/w/o: 3869.04/0.00/554.01) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 49s ] thds: 8 tps: 284.99 qps: 4541.88 (r/w/o: 3971.90/0.00/569.99) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 266.99 qps: 4292.88 (r/w/o: 3758.90/0.00/533.99) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 51s ] thds: 8 tps: 259.01 qps: 4143.22 (r/w/o: 3625.19/0.00/518.03) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 52s ] thds: 8 tps: 272.97 qps: 4350.49 (r/w/o: 3804.56/0.00/545.94) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 53s ] thds: 8 tps: 260.02 qps: 4170.27 (r/w/o: 3650.24/0.00/520.03) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 54s ] thds: 8 tps: 260.01 qps: 4158.20 (r/w/o: 3638.17/0.00/520.02) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 258.93 qps: 4161.87 (r/w/o: 3644.01/0.00/517.86) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 56s ] thds: 8 tps: 264.06 qps: 4217.92 (r/w/o: 3689.81/0.00/528.12) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 57s ] thds: 8 tps: 257.01 qps: 4101.21 (r/w/o: 3587.19/0.00/514.03) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 58s ] thds: 8 tps: 259.92 qps: 4181.72 (r/w/o: 3661.88/0.00/519.84) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 59s ] thds: 8 tps: 270.03 qps: 4286.52 (r/w/o: 3746.45/0.00/540.07) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 257.05 qps: 4144.75 (r/w/o: 3630.66/0.00/514.09) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 61s ] thds: 8 tps: 267.99 qps: 4286.78 (r/w/o: 3750.81/0.00/535.97) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 62s ] thds: 8 tps: 262.99 qps: 4185.89 (r/w/o: 3659.91/0.00/525.99) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 63s ] thds: 8 tps: 260.02 qps: 4155.32 (r/w/o: 3636.28/0.00/519.04) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 64s ] thds: 8 tps: 265.00 qps: 4256.01 (r/w/o: 3725.01/0.00/531.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 8 tps: 265.99 qps: 4268.79 (r/w/o: 3736.81/0.00/531.97) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 66s ] thds: 8 tps: 264.00 qps: 4217.01 (r/w/o: 3689.01/0.00/528.00) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 67s ] thds: 8 tps: 267.00 qps: 4258.00 (r/w/o: 3724.00/0.00/534.00) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 68s ] thds: 8 tps: 259.01 qps: 4156.20 (r/w/o: 3638.18/0.00/518.03) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 69s ] thds: 8 tps: 263.99 qps: 4218.77 (r/w/o: 3690.80/0.00/527.97) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 8 tps: 270.00 qps: 4312.06 (r/w/o: 3772.05/0.00/540.01) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 71s ] thds: 8 tps: 272.01 qps: 4358.20 (r/w/o: 3814.17/0.00/544.02) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 72s ] thds: 8 tps: 284.00 qps: 4537.93 (r/w/o: 3969.94/0.00/567.99) lat (ms,99%): 45.79 err/s: 0.00 reconn/s: 0.00
[ 73s ] thds: 8 tps: 263.00 qps: 4203.02 (r/w/o: 3677.02/0.00/526.00) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 74s ] thds: 8 tps: 268.99 qps: 4326.81 (r/w/o: 3788.84/0.00/537.98) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 8 tps: 260.00 qps: 4162.00 (r/w/o: 3642.00/0.00/520.00) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 76s ] thds: 8 tps: 263.91 qps: 4209.58 (r/w/o: 3681.75/0.00/527.82) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 77s ] thds: 8 tps: 281.11 qps: 4509.74 (r/w/o: 3947.52/0.00/562.22) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 78s ] thds: 8 tps: 271.00 qps: 4314.98 (r/w/o: 3772.98/0.00/542.00) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 79s ] thds: 8 tps: 274.99 qps: 4376.81 (r/w/o: 3826.83/0.00/549.98) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 8 tps: 260.96 qps: 4204.41 (r/w/o: 3682.48/0.00/521.93) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 81s ] thds: 8 tps: 264.05 qps: 4219.80 (r/w/o: 3691.70/0.00/528.10) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 82s ] thds: 8 tps: 272.94 qps: 4349.00 (r/w/o: 3803.12/0.00/545.87) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 83s ] thds: 8 tps: 268.06 qps: 4310.02 (r/w/o: 3773.90/0.00/536.13) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 84s ] thds: 8 tps: 269.00 qps: 4296.95 (r/w/o: 3758.95/0.00/537.99) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 8 tps: 260.95 qps: 4186.21 (r/w/o: 3664.31/0.00/521.90) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 86s ] thds: 8 tps: 262.04 qps: 4176.57 (r/w/o: 3652.50/0.00/524.07) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 87s ] thds: 8 tps: 274.91 qps: 4407.59 (r/w/o: 3857.77/0.00/549.82) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 88s ] thds: 8 tps: 272.10 qps: 4346.61 (r/w/o: 3802.41/0.00/544.20) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 89s ] thds: 8 tps: 269.00 qps: 4322.04 (r/w/o: 3784.04/0.00/538.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 8 tps: 263.90 qps: 4207.48 (r/w/o: 3679.67/0.00/527.81) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 91s ] thds: 8 tps: 269.10 qps: 4307.52 (r/w/o: 3769.33/0.00/538.19) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 92s ] thds: 8 tps: 266.00 qps: 4259.96 (r/w/o: 3727.97/0.00/532.00) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 93s ] thds: 8 tps: 265.00 qps: 4245.95 (r/w/o: 3715.96/0.00/529.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 94s ] thds: 8 tps: 273.01 qps: 4357.10 (r/w/o: 3811.08/0.00/546.01) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 8 tps: 274.97 qps: 4404.53 (r/w/o: 3854.59/0.00/549.94) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 96s ] thds: 8 tps: 268.03 qps: 4301.46 (r/w/o: 3765.40/0.00/536.06) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 97s ] thds: 8 tps: 275.90 qps: 4417.44 (r/w/o: 3865.64/0.00/551.81) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 98s ] thds: 8 tps: 269.04 qps: 4287.69 (r/w/o: 3749.61/0.00/538.09) lat (ms,99%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 99s ] thds: 8 tps: 268.98 qps: 4312.61 (r/w/o: 3774.65/0.00/537.95) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 8 tps: 275.98 qps: 4413.67 (r/w/o: 3861.71/0.00/551.96) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 101s ] thds: 8 tps: 269.97 qps: 4330.53 (r/w/o: 3790.59/0.00/539.94) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 102s ] thds: 8 tps: 285.13 qps: 4555.02 (r/w/o: 3984.77/0.00/570.25) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 103s ] thds: 8 tps: 287.00 qps: 4593.00 (r/w/o: 4019.00/0.00/574.00) lat (ms,99%): 44.98 err/s: 0.00 reconn/s: 0.00
[ 104s ] thds: 8 tps: 266.95 qps: 4278.15 (r/w/o: 3744.26/0.00/533.89) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 8 tps: 270.98 qps: 4328.70 (r/w/o: 3786.74/0.00/541.96) lat (ms,99%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 106s ] thds: 8 tps: 277.97 qps: 4452.49 (r/w/o: 3896.56/0.00/555.94) lat (ms,99%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 107s ] thds: 8 tps: 269.11 qps: 4298.70 (r/w/o: 3760.49/0.00/538.21) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 108s ] thds: 8 tps: 280.99 qps: 4481.82 (r/w/o: 3919.84/0.00/561.98) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 109s ] thds: 8 tps: 272.01 qps: 4377.18 (r/w/o: 3833.16/0.00/544.02) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 8 tps: 268.99 qps: 4268.80 (r/w/o: 3730.82/0.00/537.97) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 111s ] thds: 8 tps: 267.92 qps: 4299.72 (r/w/o: 3763.88/0.00/535.84) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 112s ] thds: 8 tps: 275.02 qps: 4415.30 (r/w/o: 3865.26/0.00/550.04) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 113s ] thds: 8 tps: 274.04 qps: 4377.69 (r/w/o: 3829.60/0.00/548.09) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 114s ] thds: 8 tps: 275.96 qps: 4400.37 (r/w/o: 3848.45/0.00/551.92) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 8 tps: 266.99 qps: 4292.90 (r/w/o: 3758.91/0.00/533.99) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 116s ] thds: 8 tps: 271.06 qps: 4351.04 (r/w/o: 3808.91/0.00/542.13) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 117s ] thds: 8 tps: 265.95 qps: 4233.22 (r/w/o: 3701.32/0.00/531.90) lat (ms,99%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 118s ] thds: 8 tps: 274.05 qps: 4392.83 (r/w/o: 3844.72/0.00/548.10) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
[ 119s ] thds: 8 tps: 272.01 qps: 4350.13 (r/w/o: 3806.11/0.00/544.02) lat (ms,99%): 49.21 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 8 tps: 266.91 qps: 4281.49 (r/w/o: 3747.67/0.00/533.81) lat (ms,99%): 48.34 err/s: 0.00 reconn/s: 0.00
Latency histogram (values are in milliseconds)
       value  ------------- distribution ------------- count
      21.496 |                                         1
      21.886 |                                         1
      22.284 |                                         1
      22.689 |                                         10
      23.101 |                                         12
      23.521 |*                                        40
      23.948 |*                                        69
      24.384 |**                                       132
      24.827 |***                                      250
      25.278 |*****                                    395
      25.737 |*********                                662
      26.205 |*************                            942
      26.681 |******************                       1313
      27.165 |************************                 1767
      27.659 |******************************           2229
      28.162 |**********************************       2525
      28.673 |**************************************   2807
      29.194 |**************************************** 2972
      29.725 |*************************************    2769
      30.265 |*********************************        2466
      30.815 |*****************************            2136
      31.375 |***********************                  1735
      31.945 |******************                       1328
      32.525 |*************                            949
      33.116 |*********                                685
      33.718 |*******                                  485
      34.330 |*****                                    370
      34.954 |****                                     287
      35.589 |***                                      220
      36.236 |**                                       177
      36.894 |**                                       156
      37.565 |*                                        106
      38.247 |*                                        101
      38.942 |*                                        100
      39.650 |*                                        58
      40.370 |                                         37
      41.104 |                                         34
      41.851 |                                         34
      42.611 |                                         33
      43.385 |*                                        41
      44.173 |*                                        47
      44.976 |*                                        78
      45.793 |**                                       114
      46.625 |**                                       151
      47.472 |**                                       145
      48.335 |**                                       181
      49.213 |**                                       125
      50.107 |*                                        97
      51.018 |*                                        86
      51.945 |*                                        45
      52.889 |                                         32
      53.850 |                                         20
      54.828 |                                         23
      55.824 |                                         10
      56.839 |                                         6
      57.871 |                                         10
      58.923 |                                         4
      59.993 |                                         6
      61.083 |                                         4
      62.193 |                                         1
      63.323 |                                         2
      64.474 |                                         3
      65.645 |                                         4
      66.838 |                                         3
      68.053 |                                         1
      69.289 |                                         1
      70.548 |                                         2
      71.830 |                                         1
      92.424 |                                         1
 
SQL statistics:
    queries performed:
        read:                            442932
        write:                           0
        other:                           63276
        total:                           506208
    transactions:                        31638  (263.60 per sec.)
    queries:                             506208 (4217.63 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      263.6018
    time elapsed:                        120.0219s
    total number of events:              31638

Latency (ms):
         min:                                   21.59
         avg:                                   30.34
         max:                                   92.01
         99th percentile:                       50.11
         sum:                               960007.38

Threads fairness:
    events (avg/stddev):           3954.7500/5.40
    execution time (avg/stddev):   120.0009/0.01